[
    {
        "name": "Ram Prabhakaran",
        "title": "Technology Leader and Product Champion",
        "context": "Worked together at Oracle",
        "quote": "Prashant is an exceptionally talented Product Manager. He uses strategic and analytical thinking in the product management lifecycle. He's well-respected, dedicated, and self-driven. Prashant has done an awesome job managing products, backlogs, and owning feature deliverables, always leading from the front. He will be a great asset to any company."
    },
    {
        "name": "Dana Toy",
        "title": "Principal Program Manager at SAP Concur",
        "context": "Managed Prashant during his internship",
        "quote": "I really appreciated Prashant's strategic mindset and his ability to get into the weeds to get work done. He quickly got up to speed, carrying a long-term vision forward during his short time on the team. I would highly recommend Prashant."
    },
    {
        "name": "Hrishikesh Deshmukh",
        "title": "Director User Experience Design at Salesforce",
        "context": "Collaborated on UX projects",
        "quote": "Prashant is an all-rounder. His ability to take keen interest in the domain and his ever-curious mind makes him an excellent addition to any team. Prashant has a deep-rooted sense of responsibility that ensures his reliability."
    },
    {
        "name": "Bhushan Bandekar",
        "title": "Program Director - Cloud.AI | Enterprise Data Architect",
        "context": "Worked on a project for a Telecom customer",
        "quote": "Prashant is undoubtedly one of the most enterprising persons I have known. He showed exemplary skill in understanding technical intricacies and using his creative talent to articulate and design. Prashant stands out for his commitment to work and never-give-up attitude."
    },
    {
        "name": "Swapnil Godambe",
        "title": "Senior Engineer at Wayfair",
        "context": "Collaborated on final Engineering project",
        "quote": "Prashant played a key role in our 'Image Recognition and Classification' project. He is meticulous in understanding fine-grained concepts, a quick learner, and highly professional in all aspects of work."
    },
    {
        "name": "Rohit Nayal",
        "title": "Customer Success Lead - Forecasting & Supply Chain",
        "context": "Managed Prashant in a previous role",
        "quote": "Prashant's first impression was of an enthusiastic and inquisitive person. I was particularly impressed by his in-depth analysis and quality of delivery. Prashant would be an asset to any team."
    },
    {
        "name": "Abhijit Sawant",
        "title": "Data Scientist - Daimler Truck",
        "context": "Collaborated on multiple occasions",
        "quote": "Prashant comes across as a very intelligent individual who can grasp the situation at hand, identify core issues, and take action. He's a quick learner, eager to expand his intellectual horizons, and a thorough professional."
    }
]