[
    {
        "name": "Kaylie VanWolvelaere",
        "title": "Product Marketer & GTM Strategist",
        "relationship": "product marketing partner in crime",
        "quote": "Prashant has been <strong>the most strategic and capable product managers</strong> I've had the pleasure of working with. We partnered closely for over two years on our Shopify integration, during which he consistently demonstrated sharp product instincts, strong cross-functional leadership, and a deep commitment to delivering meaningful customer value. Prashant is excellent at prioritizing roadmap items based on customer needs, level of effort, and level of impact. He's a thoughtful collaborator who ensures the right stakeholders are involved at the right times. Prashant is reliable and can be counted on to do what he says he's going to do. I admire that he doesn't settle for the status quo - he is always looking for ways to innovate, problem-solve, and not default to doing things the way they've always been done. Prashant approaches problems with curiosity and creativity and I was constantly learning from him. I don't think there is anyone else who could've handled this specific project we worked on together and I hope our paths cross again."
    },
    {
        "name": "India Anderson",
        "title": "Director, Product Management @ Avalara",
        "relationship": "manager, cheerleader and champion",
        "quote": "TLDR - <strong>If you get the opportunity to have Prashant on your team, do it.</strong> I had the pleasure of managing Prashant during his time at Avalara, and he consistently stood out as a thoughtful, dependable, and technically sharp team member. Prashant brought <strong>a rare combination of product thinking, attention to detail, and calm execution</strong> to every initiative he touched. One of Prashant's standout strengths is his deep technical acumen. He played a key role in helping our developers ramp up on the new tax platform with Shopify — not only by understanding the nuances of the integration himself, but by actively mentoring others and translating complex concepts into clear, actionable guidance. His ability to bridge product and engineering made him a critical contributor to accelerating team onboarding and delivery. Whether he was diving deep into system behavior to identify root causes, collaborating across functions to unblock progress, or refining requirements to ensure clarity and precision, Prashant approached each challenge with both humility and rigor. His user-first mindset grounded decisions in real-world customer experience, and he consistently worked to build solutions that were not just functional, but elegant and maintainable. He's the kind of teammate who makes a team better — not just through his work, but through the steady, collaborative energy he brings to every project. He helped to level up the team like a rising tide. I'd gladly work with him again and recommend him without hesitation."
    },
    {
        "name": "Oliver St.George",
        "title": "Sr. PMM @ Avalara",
        "relationship": "partner marketing co-conspirator",
        "quote": "As a product manager, Prashant is incredibly thoughtful, collaborative, and solutions-oriented. <strong>Prashant consistently brings clarity to complex challenges and has a knack for balancing technical considerations with the customer experience.</strong> Whether we were launching new functionality or navigating edge cases with merchants, I could always count on Prashant. What stands out most is their dedication to cross-functional collaboration. Prashant makes it easy to align across teams — from product and engineering to marketing and sales — ensuring that we're all working toward a shared goal. If you're looking for a product manager who leads with empathy, executes with precision, and is genuinely great to work with, I can't recommend Prashant highly enough."
    },
    {
        "name": "Ram Prabhakaran",
        "title": "Technology Leader @ Oracle",
        "relationship": "mentor and guide",
        "quote": "Prashant is an exceptionally talented Product Manager and I am super glad we hired him at the right time to help us out on the CX Platform team. He comes with an MBA Background which is super valuable and he uses a lot of strategic and analytical thinking into the product management lifecycle and process. He is definitely one of the very smart PMs I have worked with in my Career. He is well respected, extremely dedicated and a motivated and self driven individual. He has done an awesome job managing his products, backlogs and owning feature deliverables on our Oracle CX Releases. He always believes in overseeing and <strong>leading from the front, delivering on several critical Projects which added Business Value and Increased Revenue</strong> for our company. Prashant will be a great asset to any company that hires him. He has my highest recommendation."
    },
    {
        "name": "Dana Toy",
        "title": "Principal Program Manager @ SAP Concur",
        "relationship": "MBA internship manager and advisor",
        "quote": "Prashant was a summer graduate intern on my team. I really appreciated <strong>his strategic mindset as well as his ability to get into the weeds</strong> to get work done. He quickly got up to speed on what we asked of him carrying a long-term vision forward during his short time on the team. I would highly recommend Prashant."
    },
    {
        "name": "Hrishikesh Deshmukh",
        "title": "Director UX Design @ Seismic",
        "relationship": "UX guru and leader",
        "quote": "<strong>Prashant is an all rounder. May it be coding, understanding the critical aspects of business or testing and deployment</strong>, Prashant is the guy you would be looking out for. His ability to take keen interest in the domain that he is working in and his ever curious mind makes him an excellent addition to a team. Prashant has a deep rooted sense of responsibility that ensures his reliability in the team. I had a pleasure of working with Prashant for last one year and would not hesitate to work with him any time in future."
    },
    {
        "name": "Bhushan Bandekar",
        "title": "Program Director @ TCS",
        "relationship": "architecture guru at TCS",
        "quote": "Prashant is undoubtedly one of the most enterprising person I have known. As a Data Management CoE lead I use to often interact with Prashant for User Experience consultation. One such incident which stands-out is where I had to make a time-bound powerful but compact presentation to a Telecom customer and Prashant helped me to build a product flyer for a Hadoop based product which I had architected. Prashant showed <strong>exemplary skill in understanding the Technical intricacies and use his creative talent to articulate & design</strong> the flyer cum presentation. Prashant stands out for his commitment to work, never-give-up attitude. This makes him an asset to any team, group & organization."
    },
    {
        "name": "Swapnil Godambe",
        "title": "Member of Technical Staff @ PayPal",
        "relationship": "engineering school project partner",
        "quote": "We had worked together on our final Engineering project which was 'Image Recognition and Classification', wherein we had implemented a clustering algorithm for recognition and classification purposes. Prashant played a key role in successful implementation of the project. He is <strong>very meticulous in understanding the fine grained concepts, is a quick learner, and comes to me as a highly professional person</strong> in all aspects of work. Working with him on this project was a very nice experience for me and I wish him all the very best for his future endeavors."
    },
    {
        "name": "Rohit Nayal",
        "title": "Manager, Customer Success @ Zebra Technologies",
        "relationship": "first professional manager and mentor",
        "quote": "First impression is the last impression and the first impression of Prashant when he joined my team was of an enthusiastic and inquisitive person. I was particularly impressed by <strong>his in-depth analysis and the quality of delivery</strong>. Prashant would be an asset to any team."
    },
    {
        "name": "Abhijit Sawant",
        "title": "Data Scientist @ Daimler Truck",
        "relationship": "long-time collaborator at TCS and ZS",
        "quote": "I have had the opportunity to collaborate with Prashant on number of occasions. Prashant comes across as a very intelligent individual who can <strong>grasp the situation at hand, identify the core issues and take action</strong>. He is a quick learner and I always find him eager to expand this intellectual horizons. He is a thorough professional and working with him has always been a pleasure."
    }
]
